yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/canfd_reg.h
/**************************************************************************//**
* @file     canfd_reg.h
* @version  V1.00
* @brief    CANFD register definition header file
*
* SPDX-License-Identifier: Apache-2.0
* @copyright (C) 2022 Nuvoton Technology Corp. All rights reserved.
*****************************************************************************/

#ifndef __CANFD_REG_H__
#define __CANFD_REG_H__

#if defined ( __CC_ARM   )
#pragma anon_unions
#endif


/******************************************************************************/
/*                Device Specific Peripheral registers structures             */
/******************************************************************************/

/**
@addtogroup REGISTER Control Register
@{
*/

/**
@addtogroup CANFD Controller Area Network with Flexible Data-Rate (CANFD)
Memory Mapped Structure for CANFD Controller
@{
*/

typedef struct
{
/**
* @var CANFD_T::DBTP
* Offset: 0x0C  Data Bit Timing & Prescaler Register Register
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |7[3:0]  |DSJW      |Data (Re) Synchronization Jump Width
* |        |          |Valid values are 0 to 15.
* |        |          |The actual interpretation by the hardware of this value is such that one more than the programmed value is used
* |        |          |tSJW = (DSJW + 1) x tq.
* |[7:4]   |DTSEG2    |Data time segment after sample point
* |        |          |Valid values are 0 to 15.
* |        |          |The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
* |        |          |tBS2 = (DTSEG2 + 1) x tq.
* |[12:8]  |DTSEG1    |Data time segment before sample point
* |        |          |Valid values are 0 to 31.
* |        |          |The actual interpretation by the hardware of this value is such that one more than the programmed value is used.
* |        |          |tBS1 = (DTSEG1 + 1) x tq.
* |[20:16] |DBRP      |Data Bit Rate Prescaler
* |        |          |The value by which the oscillator frequency is divided for generating the bit time quanta.
* |        |          |The bit time is built up from a multiple of this quanta. Valid values for the Bit Rate Prescaler are 0 to 31. When TDC ='1',the range is limited to 0,1.
* |        |          |The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
* |[23]    |TDC       |Transmitter Delay Compensation
* |        |          |0 = Transmitter Delay Compensation disabled.
* |        |          |1 = Transmitter Delay Compensation enabled.
* ---------------------------------------------------------------------------------------------------
* @var CANFD_T::TEST
	* Offset: 0x10  Test Register (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[4]     |LBCK      |Loop Back Mode
* |        |          |0 = Reset value, Loop Back Mode is disabled.
* |        |          |1 = Loop Back Mode is enabled (refer to 1.1.5.1 TEST Mode).
* |[6:5]   |TX        |Control of Transmit Pin
* |        |          |00 = Reset value, CANx_TXD controlled by the CAN Core, updated at the end of the CAN bit time.
* |        |          |01 = Sample Point can be monitored at pin CANx_TXD.
* |        |          |10 = Dominant ('0') level at pin CANx_TXD.
* |        |          |11 = Recessive ('1') level at pin CANx_TXD.
* |[7]     |RX        |Receive Pin
* |        |          |Monitors the actual value of pin CANx_RXD
* |        |          |0 = The CAN bus is dominant (CANx_RXD = 0).
* |        |          |1 = The CAN bus is recessive (CANx_RXD = 1).
* @var CANFD_T::RWD
* Offset: 0x14  RAM Watchdog (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[7:0]   |WDC       |Watchdog Configuration
* |        |          |Start value of the Message RAM Watchdog Counter. With the reset value of 00 the counter is disabled.
* |[15:8]  |WDV       |Watchdog Value
* |        |          |Actual Message RAM Watchdog Counter Value.
* @var CANFD_T::CCCR
* Offset: 0x18  CC Control Register (Pp*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[0]     |INIT      |Initialization
* |        |          |0 = Normal Operation.
* |        |          |1 = Initialization is started.
* |        |          |Note: Due to the synchronization mechanism between the two clock domains, there may be a delay until the value written to INIT can be read back.
* |        |          |Therefore the programmer has to assure that the previous value written to INIT has been accepted by reading INIT before setting INIT to a new value.
* |[1]     |CCE       |Configuration Change Enable
* |        |          |0 = The CPU has no write access to the protected configuration registers.
* |        |          |1 = The CPU has write access to the protected configuration registers (while INIT (CANFD_CCCR[0]) = 1).
* |[2]     |ASM       |Restricted Operation Mode
* |        |          |Bit ASM can only be set by the Host when both CCE and INIT are set to 1.
* |        |          |The bit can be reset by the Host software at any time.
* |        |          |This bit will be set automatically set to 1 when the Tx handler was not able to read data from the message RAM in time.
* |        |          |For a description of the Restricted Operation Mode refer to Restricted Operation Mode.
* |        |          |0 = Normal CAN operation.
* |        |          |1 = Restricted Operation Mode active.
* |[3]     |CSA       |Clock Stop Acknowledge
* |        |          |0 = No clock stop acknowledged.
* |        |          |1 = The Controller may be set in power down by stopping AHB clock and CAN Core clockcclk.
* |[4]     |CSR       |Clock Stop Request
* |        |          |0 = No clock stop is requested.
* |        |          |1 = Clock stop requested.
* |        |          |When clock stop is requested, first INIT and then CSA will be set after all pending transfer requests have been completed and the CAN bus reached idle.
* |[5]     |MON       |Bus Monitoring Mode
* |        |          |Bit MON can only be set by the Host when both CCE and INIT are set to 1.
* |        |          |The bit can be reset by the Host at any time.
* |        |          |0 = Bus Monitoring Mode is disabled.
* |        |          |1 = Bus Monitoring Mode is enabled.
* |[6]     |DAR       |Disable Automatic Retransmission
* |        |          |0 = Automatic retransmission of messages not transmitted successfully enabled.
* |        |          |1 = Automatic retransmission disabled.
* |[7]     |TEST      |Test Mode Enable
* |        |          |0 = Normal operation, register TEST holds reset values.
* |        |          |1 = Test Mode, write access to register TEST enabled.
* |[8]     |FDOE      |FD Operation Enable
* |        |          |0 = FD operation disabled.
* |        |          |1 = FD operation enabled.
* |[9]     |BRSE      |Bit Rate Switch Enable
* |        |          |0 = Bit rate switching for transmissions disabled.
* |        |          |1 = Bit rate switching for transmissions enabled.
* |        |          |Note: When CAN FD operation is disabled FDOE = 0, BRSE is not evaluated.
* |[12]    |PXHD      |Protocol Exception Handling Disable
* |        |          |0 = Protocol exception handling enabled.
* |        |          |1 = Protocol exception handling disabled.
* |        |          |Note: When protocol exception handling is disabled, the controller will transmit an error frame when it detects a protocol exception condition.
* |[13]    |EFBI      |Edge Filtering during Bus Integration
* |        |          |0 = Edge filtering disabled.
* |        |          |1 = Two consecutive dominant tq required to detect an edge f or hard synchronization.
* |[14]    |TXP       |Transmit Pause
* |        |          |If this bit is set, the CAN FD controller pauses for two CAN bit times before starting the next transmission after itself has successfully transmitted a frame (refer to 1.1.5.5).
* |        |          |0 = Transmit pause disabled.
* |        |          |1 = Transmit pause enabled.
* |[15]    |NISO      |Non ISO Operation
* |        |          |If this bit is set, the CAN FD controller uses the CAN FD frame format as specified by the Bosch CAN FD Specification V1.0.
* |        |          |0 = CAN FD frame format according to ISO 11898-1:2015.
* |        |          |1 = CAN FD frame format according to Bosch CAN FD Specification V1.0.
* @var CANFD_T::NBTP
* Offset: 0x1C  Nominal Bit Timing & Prescaler Register (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[6:0]   |NTSEG2    |Nominal Time segment after sample point
* |        |          |0x01-0x7F Valid values are 1 to 127.
* |        |          |The actual interpretation by the hardware of this value is such that one more than the programmed value is used
* |        |          |tBS2 = (NTSEG2 + 1) x tq.
* |        |          |Note: With a CAN Core clock (cclk) of 8 MHz, the reset value of 0x06000A03 configures the controller for a bit rate of 500 kBit/s.
* |[15:8]  |NTSEG1    |Nominal Time segment before sample point
* |        |          |Valid values are 1 to 255.
* |        |          |The actual interpretation by the hardware of this value is such that one more than the programmed value is used
* |        |          |tBS1 = (NTSEG1 + 1) x tq.
* |[24:16] |NBRP      |Nominal Bit Rate Prescaler
* |        |          |The value by which the oscillator frequency is divided for generating the bit time quanta
* |        |          |The bit time is built up from a multiple of this quanta
* |        |          |Valid values for the Bit Rate Prescaler are 0 to 511
* |        |          |The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
* |[31:25] |NSJW      |Nominal Re-Synchronization Jump Width
* |        |          |Valid values are 0 to 127
* |        |          |Should be smaller than NTSEG2
* |        |          |The actual interpretation by the hardware of this value is such that one more than the value programmed here is used
* |        |          |tSJW = (NSJW + 1) x tq.
* @var CANFD_T::TSCC
* Offset: 0x20  Timestamp Counter Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[1:0]   |TSS       |Timestamp Select
* |        |          |00 = Timestamp counter value always 0x0000.
* |        |          |01 = Timestamp counter value incremented according to TCP and the time unit is CAN bit times.
* |        |          |10 = Timestamp counter value incremented according to TCP and the time unit is CAN Core clock.
* |        |          |11 = Same as '00'.
* |[19:16] |TCP       |Timestamp Counter Prescaler
* |        |          |Configures the timestamp and timeout counters time unit in multiples of CAN bit times [ 1...16 ].
* |        |          |The actual interpretation by the hardware of this value is such that one more than the value programmed here is used.
* @var CANFD_T::TSCV
* Offset: 0x24  Timestamp Counter Value (C*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[15:0]  |TSC       |Timestamp Counter
* |        |          |The internal/external Timestamp Counter value is captured on start of frame (both Rx and Tx)
* |        |          |When TSS (CANFD_TSCC[[1:0]) = 2'b01, the Timestamp Counter is incremented in multiples of CAN bit times  [ 1...16 ] depending on the configuration of TCP (CANFD_TSCC[19:16])
* |        |          |A wrap around sets interrupt flag TSW (CANFD_IR[16])
* |        |          |Write access resets the counter to zero
* |        |          |When TSS (CANFD_TSCC[1:0]) = 10, TSC reflects the external Timestamp Counter value
* |        |          |A write access has no impact.
* |        |          |Note: A "wrap around" is a change of the Timestamp Counter value from non-zero to zero not caused by write access to CANFD_TSCV.
* @var CANFD_T::TOCC
* Offset: 0x28  Timeout Counter Conufiguration
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[0]     |ETOC      |Enable Timeout Counter
* |        |          |0 = Timeout Counter disabled.
* |        |          |1 = Timeout Counter enabled.
* |        |          |Note: For use of timeout function with CAN FD refer to 1.1.5.3.
* |[2:1]   |TOS       |Timeout Select
* |        |          |When operating in Continuous mode, a write to CANFD_TOCV presets the counter to the value configured by CANFD_TOP (TOCC[31:16]) and continues down-counting
* |        |          |When the Timeout Counter is controlled by one of the FIFOs, an empty FIFO presets the counter to the value configured by CANFD_TOP (TOCC[31:16])
* |        |          |Down-counting is started when the first FIFO element is stored.
* |        |          |00 = Continuous operation.
* |        |          |01 = Timeout controlled by Tx Event FIFO.
* |        |          |10 = Timeout controlled by Rx FIFO 0.
* |        |          |11 = Timeout controlled by Rx FIFO 1.
* |[31:16] |TOP       |Timeout Period
* |        |          |Start value of the Timeout Counter (down-counter). Configures the Timeout Period.
* @var CANFD_T::TOCV
* Offset: 0x2C  Timeout Counter Value (C*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[15:0]  |TOC       |Timeout Counter
* |        |          |The filed is decremented in multiples of CAN bit times [ 1...16 ] depending on the configuration of TCP (CANFD_TSCC[19:16])
* |        |          |When decremented to zero, interrupt flag TOO (CANFD_IR[18]) is set and the timeout counter is stopped
* |        |          |Start and reset/restart conditions are configured via TOS (CANFD_TOCC[1:0]).
* @var CANFD_T::ECR
* Offset: 0x40  Error Counter Register (X*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[7:0]   |TEC       |Transmit Error Counter
* |        |          |Actual state of the Transmit Error Counter, values between 0 and 255.
* |        |          |Note: When ASM (CANFD_CCCR[2]) is set, the CAN protocol controller does not increment TEC and REC when a CAN protocol error is detected, but CEL is still incremented.
* |[14:8]  |REC       |Receive Error Counter
* |        |          |Actual state of the Receive Error Counter, values between 0 and 127.
* |[15]    |RP        |Receive Error Passive
* |        |          |0 = The Receive Error Counter is below the error passive level of 128.
* |        |          |1 = The Receive Error Counter has reached the error passive level of 128.
* |[23:16] |CEL       |CAN Error Logging
* |        |          |The counter is incremented each time when a CAN protocol error causes the 8-bit Transmit Error Counter TEC or the 7-bit Receive Error Counter REC to be incremented.
* |        |          |The counter is also incremented when the Bus_Off limit is reached.
* |        |          |It is not incremented when only RP is set without changing REC.
* |        |          |The increment of CEL follows after the increment of REC or TEC.
* |        |          |The counter is reset by read access to CEL.
* |        |          |The counter stops at 0xFF; the next increment of TEC or REC sets interrupt flag ELO (CANFD_IR[22]).
* @var CANFD_T::PSR
* Offset: 0x44  Protocol Status Register (XS*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[2:0]   |LEC       |Last Error Code
* |        |          |The LEC indicates the type of the last error to occur on the CAN bus.
* |        |          |This field will be cleared to 0 when a message has been transferred (reception or transmission) without error.
* |        |          |000 = No Error: No error occurred since LEC has been reset by successful reception or transmission.
* |        |          |001 = Stuff Error: More than 5 equal bits in a sequence have occurred in a part of a received message where this is not allowed.
* |        |          |010 = Form Error: A fixed format part of a received frame has the wrong format.
* |        |          |011 = AckError: The message transmitted by the CANFD CONTROLLER was not acknowledged by another node.
* |        |          |100 = Bit1Error: During the transmission of a message (with the exception of the arbitration field), the device wanted to send a recessive level (bit of logical value 1), but the monitored bus value was dominant.
* |        |          |101 = Bit0Error : During the transmission of a message (or acknowledge bit, or active error flag, or overload flag), the device wanted to send a dominant level (data or identifier bit logical value 0), but the monitored bus value was recessive
* |        |          |During Bus_Off recovery this status is set each time a sequence of 11 recessive bits has been monitored.
* |        |          |This enables the CPU to monitor the proceeding of the Bus_Off recovery sequence (indicating the bus is not stuck at dominant or continuously disturbed).
* |        |          |110 = CRCError: The CRC check sum of a received message was incorrect.
* |        |          |The CRC of an incoming message does not match with the CRC calculated from the received data.
* |        |          |111 = NoChange: Any read access to the Protocol Status Register re-initializes the LEC to 7.When the LEC shows the value 7, no CAN bus event was detected since the last CPU read access to the Protocol Status Register.
* |[4:3]   |ACT       |Activity
* |        |          |Monitors the module's CAN communication state.
* |        |          |00 = Synchronizing - node is synchronizing on CAN communication.
* |        |          |01 = Idle - node is neither receiver nor transmitter.
* |        |          |10 = Receiver - node is operating as receiver.
* |        |          |11 = Transmitter - node is operating as transmitter.
* |[5]     |EP        |Error Passive
* |        |          |0 = The CAN FD controller is in the Error_Active state.
* |        |          |It normally takes part in bus communication and sends an active error flag when an error has been detected.
* |        |          |1 = The CAN FD controller is in the Error_Passive state.
* |[6]     |EW        |Warning Status
* |        |          |0 = Both error counters are below the Error_Warning limit of 96.
* |        |          |1 = At least one of error counter has reached the Error_Warning limit of 96.
* |[7]     |BO        |Bus_Off Status
* |        |          |0 = The CAN FD controller is not Bus_Off.
* |        |          |1 = The CAN FD controller is in Bus_Off state.
* |[10:8]  |DLEC      |Data Phase Last Error Code
* |        |          |Type of last error that occurred in the data phase of a CAN FD format frame with its BRS flag set.
* |        |          |Coding is the same as for LEC.
* |        |          |This field will be cleared to zero when a CAN FD format frame with its BRS flag set has been transferred (reception or transmission) without error.
* |[11]    |RESI      |ESI flag of last received CAN FD Message
* |        |          |This bit is set together with RFDF, independent of acceptance filtering.
* |        |          |0 = Last received CAN FD message did not have its ESI flag set.
* |        |          |1 = Last received CAN FD message had its ESI flag set.
* |[12]    |RBRS      |BRS flag of last received CAN FD Message
* |        |          |This bit is set together with RFDF, independent of acceptance filtering.
* |        |          |0 = Last received CAN FD message did not have its BRS flag set.
* |        |          |1 = Last received CAN FD message had its BRS flag set.
* |        |          |Note: Byte access: Reading byte 0 will reset RBRS, reading bytes 3/2/1 has no impact.
* |[13]    |RFDF      |Received a CAN FD Message
* |        |          |This bit is set independent of acceptance filtering.
* |        |          |0 = Since this bit was reset by the CPU, no CAN FD message has been received.
* |        |          |1 = Message in CAN FD format with FDF flag set has been received.
* |        |          |Note: Byte access: Reading byte 0 will reset RFDF, reading bytes 3/2/1 has no impact.
* |[14]    |PXE       |Protocol Exception Event
* |        |          |0 = No protocol exception event occurred since last read access.
* |        |          |1 = Protocol exception event occurred.
* |[22:16] |TDCV      |Transmitter Delay Compensation Value
* |        |          |Position of the secondary sample point, defined by the sum of the measured delay from CANx_TXD to CANx_RXD and TDCO (TDCR[[14:8]).
* |        |          |The SSP position is, in the data phase, the number of minimum time quata (mtq) between the start of the transmitted bit and the secondary sample point.
* |        |          |Valid values are 0 to 127 mtq.
* @var CANFD_T::TDCR
* Offset: 0x48  Transmitter Delay Compensation Register (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[6:0]   |TDCF      |Transmitter Delay Compensation Filter Window Length
* |        |          |0x00-0x7F Defines the minimum value for the SSP position, dominant edges on CANx_RXD that would result in an earlier SSP position are ignored for transmitter delay measurement
* |        |          |The feature is enabled when TDCF is configured to a value greater than TDCO.
* |        |          |Valid values are 0 to 127 mtq.
* |[14:8]  |TDCO      |Transmitter Delay Compensation SSP Offset
* |        |          |0x00-0x7F Offset value defining the distance between the measured delay from CANx_TXD to CANx_RXD and the secondary sample point.
* |        |          |Valid values are 0 to 127 mtq.
* @var CANFD_T::IR
* Offset: 0x50  Interrupt Register
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[0]     |RF0N      |Rx FIFO 0 New Message
* |        |          |0 = No new message written to Rx FIFO 0.
* |        |          |1 = New message written to Rx FIFO 0.
* |[1]     |RF0W      |Rx FIFO 0 Watermark Reached
* |        |          |0 = Rx FIFO 0 fill level below watermark.
* |        |          |1 = Rx FIFO 0 fill level reached watermark.
* |[2]     |RF0F      |Rx FIFO 0 Full
* |        |          |0 = Rx FIFO 0 is not full.
* |        |          |1 = Rx FIFO 0 is full.
* |[3]     |RF0L      |Rx FIFO 0 Message Lost
* |        |          |0 = No Rx FIFO 0 message lost.
* |        |          |1 = Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of size zero.
* |[4]     |RF1N      |Rx FIFO 1 New Message
* |        |          |0 = No new message written to Rx FIFO 1.
* |        |          |1 = New message written to Rx FIFO 1.
