yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/canfd_reg.h
* |[5]     |RF1W      |Rx FIFO 1 Watermark Reached
* |        |          |0 = Rx FIFO 1 fill level below watermark.
* |        |          |1 = Rx FIFO 1 fill level reached watermark.
* |[6]     |RF1F      |Rx FIFO 1 Full
* |        |          |0 = Rx FIFO 1 is not full.
* |        |          |1 = Rx FIFO 1 is full.
* |[7]     |RF1L      |Rx FIFO 1 Message Lost
* |        |          |0 = No Rx FIFO 1 message lost.
* |        |          |1 = Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of size zero.
* |[8]     |HPM       |High Priority Message
* |        |          |0 = No high priority message received.
* |        |          |1 = High priority message received.
* |[9]     |TC        |Transmission Completed
* |        |          |0 = No transmission completed.
* |        |          |1 = Transmission completed.
* |[10]    |TCF       |Transmission Cancellation Finished
* |        |          |0 = No transmission cancellation finished.
* |        |          |1 = Transmission cancellation finished.
* |[11]    |TFE       |Tx FIFO Empty
* |        |          |0 = Tx FIFO non-empty.
* |        |          |1 = Tx FIFO empty.
* |[12]    |TEFN      |Tx Event FIFO New Entry
* |        |          |0 = Tx Event FIFO unchanged.
* |        |          |1 = Tx Handler wrote Tx Event FIFO element.
* |[13]    |TEFW      |Tx Event FIFO Watermark Reached
* |        |          |0 = Tx Event FIFO fill level below watermark.
* |        |          |1 = Tx Event FIFO fill level reached watermark.
* |[14]    |TEFF      |Tx Event FIFO Full
* |        |          |0 = Tx Event FIFO is not full.
* |        |          |1 = Tx Event FIFO is full.
* |[15]    |TEFL      |Tx Event FIFO Element Lost
* |        |          |0 = No Tx Event FIFO element lost.
* |        |          |1 = Tx Event FIFO element lost, also set after write attempt to Tx Event FIFO of size zero.
* |[16]    |TSW       |Timestamp Wraparound
* |        |          |0 = No timestamp counter wrap-around.
* |        |          |1 = Timestamp counter wrapped around.
* |[17]    |MRAF      |Message RAM Access Failure
* |        |          |The flag is set, when the Rx Handler
* |        |          |Has not completed acceptance filtering or storage of an accepted message until the arbitration field of the following message has been received.
* |        |          |In this case acceptance filtering or message storage is aborted and the Rx Handler starts processing of the following message.
* |        |          |Was not able to write a message to the Message RAM. In this case message storage is aborted.
* |        |          |In both cases the FIFO put index is not updated resp.
* |        |          |The New Data flag for a dedicated Rx Buffer is not set, a partly stored message is overwritten when the next message is stored to this location.
* |        |          |The flag is also set when the Tx Handler was not able to read a message from the Message RAM in time.
* |        |          |In this case message transmission is aborted.
* |        |          |In case of a Tx Handler access failure the CAN FD controller is switched into Restricted Operation Mode (refer to Restricted Operation Mode).
* |        |          |To leave Restricted Operation Mode, the Host CPU has to reset CANFD_ASM (CANFD_CCCR[2]).
* |        |          |0 = No Message RAM access failure occurred.
* |        |          |1 = Message RAM access failure occurred.
* |[18]    |TOO       |Timeout Occurred
* |        |          |0 = No timeout.
* |        |          |1 = Timeout reached.
* |[19]    |DRX       |Message stored to Dedicated Rx Buffer
* |        |          |The flag is set whenever a received message has been stored into a dedicated Rx Buffer.
* |        |          |0 = No Rx Buffer updated.
* |        |          |1 = At least one received message stored into an Rx Buffer.
* |[20]    |BEC       |Bit Error Corrected
* |        |          |Message RAM bit error detected and corrected
* |        |          |Controlled by input signal m_can_aeim_berr[0] generated by an optional external parity / ECC logic attached to the Message RAM.
* |        |          |0 = No bit error detected when reading from Message RAM.
* |        |          |1 = Bit error detected and corrected (e.g. ECC).
* |[21]    |BEU       |Bit Error Uncorrected
* |        |          |Message RAM bit error detected, uncorrected
* |        |          |Controlled by input signal m_can_aeim_berr[1] generated by an optional external parity / ECC logic attached to the Message RAM
* |        |          |An uncorrected Message RAM bit error sets CCCR.INIT to u20181u2019
* |        |          |This is done to avoid transmission of corrupted data.
* |        |          |0 = No bit error detected when reading from Message RAM.
* |        |          |1 = Bit error detected, uncorrected (e.g. parity logic).
* |[22]    |ELO       |Error Logging Overflow
* |        |          |0= CAN Error Logging Counter did not overflow.
* |        |          |1= Overflow of CAN Error Logging Counter occurred.
* |[23]    |EP        |Error Passive
* |        |          |0 = Error_Passive status unchanged.
* |        |          |1 = Error_Passive status changed.
* |[24]    |EW        |Warning Status
* |        |          |0 = Error_Warning status unchanged.
* |        |          |1 = Error_Warning status changed.
* |[25]    |BO        |Bus_Off Status
* |        |          |0 = Bus_Off status unchanged.
* |        |          |1 = Bus_Off status changed.
* |[26]    |WDI       |Watchdog Interrupt
* |        |          |0 = No Message RAM Watchdog event occurred.
* |        |          |1 = Message RAM Watchdog event due to missing READY.
* |[27]    |PEA       |Protocol Error in Arbitration Phase
* |        |          |0 = No protocol error in arbitration phase.
* |        |          |1 = Protocol error in arbitration phase detected (LEC (CANFD_PSR[2:0]) no equal 0 or 7).
* |        |          |Note: Nominal bit time is used
* |[28]    |PED       |Protocol Error in Data Phase
* |        |          |0 = No protocol error in data phase.
* |        |          |1= Protocol error in data phase detected (DLEC (CANFD_PSR[10:8]) no equal 0 or 7).
* |        |          |Note: Data bit time is used.
* |[29]    |ARA       |Access to Reserved Address
* |        |          |0 = No access to reserved address occurred.
* |        |          |1 = Access to reserved address occurred.
* @var CANFD_T::IE
* Offset: 0x54  Interrupt Enable
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[0]     |RF0NE     |Rx FIFO 0 New Message Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[1]     |RF0WE     |Rx FIFO 0 Watermark Reached Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[2]     |RF0FE     |Rx FIFO 0 Full Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[3]     |RF0LE     |Rx FIFO 0 Message Lost Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[4]     |RF1NE     |Rx FIFO 1 New Message Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[5]     |RF1WE     |Rx FIFO 1 Watermark Reached Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[6]     |RF1FE     |Rx FIFO 1 Full Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[7]     |RF1LE     |Rx FIFO 1 Message Lost Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[8]     |HPME      |High Priority Message Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[9]     |TCE       |Transmission Completed Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[10]    |TCFE      |Transmission Cancellation Finished Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[11]    |TFEE      |Tx FIFO Empty Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[12]    |TEFNE     |Tx Event FIFO New Entry Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[13]    |TEFWE     |Tx Event FIFO Watermark Reached Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[14]    |TEFFE     |Tx Event FIFO Full Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[15]    |TEFLE     |Tx Event FIFO Event Lost Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[16]    |TSWE      |Timestamp Wraparound Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[17]    |MRAFE     |Message RAM Access Failure Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[18]    |TOOE      |Timeout Occurred Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[19]    |DRXE      |Message stored to Dedicated Rx Buffer Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[20]    |BECE      |Bit Error Corrected Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[21]    |BEUE      |Bit Error Uncorrected Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[22]    |ELOE      |Error Logging Overflow Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[23]    |EPE       |Error Passive Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[24]    |EWE       |Warning Status Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[25]    |BOE       |Bus_Off Status Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[26]    |WDIE      |Watchdog Interrupt Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[27]    |PEAE      |Protocol Error in Arbitration Phase Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[28]    |PEDE      |Protocol Error in Data Phase Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* |[29]    |ARAE      |Access to Reserved Address Enable
* |        |          |0 = Interrupt is Disabled.
* |        |          |1 = Interrupt is Enabled.
* @var CANFD_T::ILS
* Offset: 0x58  Interrupt Line Select
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[0]     |RF0NL     |Rx FIFO 0 New Message Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[1]     |RF0WL     |Rx FIFO 0 Watermark Reached Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[2]     |RF0FL     |Rx FIFO 0 Full Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[3]     |RF0LL     |Rx FIFO 0 Message Lost Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[4]     |RF1NL     |Rx FIFO 1 New Message Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[5]     |RF1WL     |Rx FIFO 1 Watermark Reached Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[6]     |RF1FL     |Rx FIFO 1 Full Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[7]     |RF1LL     |Rx FIFO 1 Message Lost Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[8]     |HPML      |High Priority Message Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[9]     |TCL       |Transmission Completed Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[10]    |TCFL      |Transmission Cancellation Finished Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[11]    |TFEL      |Tx FIFO Empty Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[12]    |TEFNL     |Tx Event FIFO New Entry Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[13]    |TEFWL     |Tx Event FIFO Watermark Reached Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[14]    |TEFFL     |Tx Event FIFO Full Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[15]    |TEFLL     |Tx Event FIFO Event Lost Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[16]    |TSWL      |Timestamp Wraparound Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[17]    |MRAFL     |Message RAM Access Failure Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[18]    |TOOL      |Timeout Occurred Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[19]    |DRXL      |Message stored to Dedicated Rx Buffer Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[20]    |BECL      |Bit Error Corrected Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[21]    |BEUL      |Bit Error Uncorrected Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1. 
* |[22]    |ELOL      |Error Logging Overflow Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[23]    |EPL       |Error Passive Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[24]    |EWL       |Warning Status Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[25]    |BOL       |Bus_Off Status Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[26]    |WDIL      |Watchdog Interrupt Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[27]    |PEAL      |Protocol Error in Arbitration Phase Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[28]    |PEDL      |Protocol Error in Data Phase Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* |[29]    |ARAL      |Access to Reserved Address Line
* |        |          |0 = Interrupt assigned to CAN interrupt line 0.
* |        |          |1 = Interrupt assigned to CAN interrupt line 1.
* @var CANFD_T::ILE
* Offset: 0x5C  Interrupt Line Enable
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[0]     |EINT0     |Enable Interrupt Line 0
* |        |          |0 = Interrupt line m_can_int0 disabled.
* |        |          |1 = Interrupt line m_can_int0 enabled.
* |[1]     |EINT1     |Enable Interrupt Line 1
* |        |          |0 = Interrupt line m_can_int1 disabled.
* |        |          |1 = Interrupt line m_can_int1 enabled.
* @var CANFD_T::GFC
* Offset: 0x80  Global Filter Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[0]     |RRFE      |Reject Remote Frames Extended
* |        |          |0= Filter remote frames with 29-bit extended IDs.
* |        |          |1= Reject all remote frames with 29-bit extended IDs.
* |[1]     |RRFS      |Reject Remote Frames Standard
* |        |          |0= Filter remote frames with 11-bit standard IDs.
* |        |          |1= Reject all remote frames with 11-bit standard IDs.
* |[3:2]   |ANFE      |Accept Non-matching Frames Extended
* |        |          |Defines how received messages with 29-bit IDs that do not match any element of the filter list are treated.
* |        |          |00 = Accept in Rx FIFO 0.
* |        |          |01 = Accept in Rx FIFO 1.
* |        |          |10 = Reject.
* |        |          |11 = Reject.
* |[5:4]   |ANFS      |Accept Non-matching Frames Standard
* |        |          |Defines how received messages with 11-bit IDs that do not match any element of the filter list are treated.
* |        |          |00 = Accept in Rx FIFO 0.
* |        |          |01 = Accept in Rx FIFO 1.
* |        |          |10 = Reject.
* |        |          |11 = Reject.
* @var CANFD_T::SIDFC
* Offset: 0x84  Standard ID Filter Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[15:2]  |FLSSA     |Filter List Standard Start Address
* |        |          |Start address of standard Message ID filter list (32-bit word address, refer to Figure 1.1-11).
* |[23:16] |LSS       |List Size Standard
* |        |          |0= No standard Message ID filter.
* |        |          |1-128 = Number of standard Message ID filter elements.
* |        |          |>128= Values greater than 128 are interpreted as 128.
* @var CANFD_T::XIDFC
* Offset: 0x88  Extended ID Filter Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[15:2]  |FLESA     |Filter List Extended Start Address
* |        |          |Start address of extended Message ID filter list (32-bit word address, refer to Figure 1.1-11)
* |[22:16] |LSE       |List Size Extended
* |        |          |0= No extended Message ID filter.
* |        |          |1-64= Number of extended Message ID filter elements.
* |        |          |>64= Values greater than 64 are interpreted as 64.
* @var CANFD_T::XIDAM
* Offset: 0x90  Extended ID AND Mask (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[28:0]  |EIDM      |Extended ID Mask
* |        |          |For acceptance filtering of extended frames the Extended ID AND Mask is ANDed with the Message ID of a received frame
* |        |          |Intended for masking of 29-bit IDs in SAE J1939
* |        |          |With the reset value of all bits set to one the mask is not active.
* @var CANFD_T::HPMS
* Offset: 0x94  High Priority Message Status
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[5:0]   |BIDX      |Buffer Index
* |        |          |Index of Rx FIFO element to which the message was stored. Only valid when MSI[1] = 1.
* |[7:6]   |MSI       |Message Storage Indicator
* |        |          |00 = No FIFO selected.
* |        |          |01 = FIFO message lost.
* |        |          |10 = Message stored in FIFO 0.
* |        |          |11 = Message stored in FIFO 1.
* |[14:8]  |FIDX      |Filter Index
* |        |          |Index of matching filter element
* |        |          |Range is 0 to LSS (CANFD_SIDFC[23:16]) - 1 or LSE (CANFD_XIDFC[22:16]) - 1
* |[15]    |FLST      |Filter List
* |        |          |Indicates the filter list of the matching filter element.
* |        |          |0 = Standard Filter List.
* |        |          |1 = Extended Filter List.
* @var CANFD_T::NDAT1
* Offset: 0x98  New Data 1
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[31:0]  |NDn       |New Data
* |        |          |The register holds the New Data flags of Rx Buffers 0 to 31
* |        |          |The flags are set when the respective Rx Buffer has been updated from a received frame
* |        |          |The flags remain set until the Host clears them
* |        |          |A flag is cleared by writing a 1 to the corresponding bit position
* |        |          |Writing a 0 has no effect
* |        |          |A hard reset will clear the register.
* |        |          |0 = Rx Buffer not updated.
* |        |          |1 = Rx Buffer updated from new message.
* @var CANFD_T::NDAT2
* Offset: 0x9C  New Data 2
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[31:0]  |NDn       |New Data
* |        |          |The register holds the New Data flags of Rx Buffers 32 to 63
* |        |          |The flags are set when the respective Rx Buffer has been updated from a received frame
