yenchouRJ/nuc990_non-os/Library/Device/Nuvoton/NUC990/Include/canfd_reg.h
* |        |          |The flags remain set until the Host clears them
* |        |          |A flag is cleared by writing a 1 to the corresponding bit position
* |        |          |Writing a 0 has no effect
* |        |          |A hard reset will clear the register.
* |        |          |0 = Rx Buffer not updated.
* |        |          |1 = Rx Buffer updated from new message.
* @var CANFD_T::RXF0C
* Offset: 0xA0  Rx FIFO 0 Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[15:2]  |F0SA      |Rx FIFO 0 Start Address
* |        |          |Start address of Rx FIFO 0 in Message RAM (32-bit word address).
* |[22:16] |F0S       |Rx FIFO 0 Size
* |        |          |0= No Rx FIFO 0.
* |        |          |1-64= Number of Rx FIFO 0 elements.
* |        |          |>64= Values greater than 64 are interpreted as 64.
* |        |          |The Rx FIFO 0 elements are indexed from 0 to F0S-1.
* |[30:24] |F0WM      |Rx FIFO 0 Watermark
* |        |          |0= Watermark interrupt disabled.
* |        |          |1-64 = Level for Rx FIFO 0 watermark interrupt (RF0W(CANFD_IR[1]).
* |        |          |>64 = Watermark interrupt disabled.
* |[31]    |F0OM      |FIFO 0 Operation Mode
* |        |          |FIFO 0 can be operated in blocking or in overwrite mode (refer to Rx FIFOs).
* |        |          |0 = FIFO 0 blocking mode.
* |        |          |1 = FIFO 0 overwrite mode.
* @var CANFD_T::RXF0S
* Offset: 0xA4  Rx FIFO 0 Status
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[6:0]   |F0FL      |Rx FIFO 0 Fill Level
* |        |          |Number of elements stored in Rx FIFO 0, range 0 to 64
* |[13:8]  |F0GI      |Rx FIFO 0 Get Index
* |        |          |Rx FIFO 0 read index pointer, range 0 to 63.
* |[21:16] |F0PI      |Rx FIFO 0 Put Index
* |        |          |Rx FIFO 0 write index pointer, range 0 to 63.
* |[24]    |F0F       |Rx FIFO 0 Full
* |        |          |0= Rx FIFO 0 is not full.
* |        |          |1= Rx FIFO 0 is full.
* |[25]    |RF0L      |Rx FIFO 0 Message Lost
* |        |          |This bit is a copy of interrupt flagRF0L (CANFD_IR[3])
* |        |          |When CANFD_IR.RF0L is reset, this bit is also reset
* |        |          |0 = No Rx FIFO 0 message lost.
* |        |          |1 = Rx FIFO 0 message lost, also set after write attempt to Rx FIFO 0 of size zero.
* |        |          |Note: Overwriting the oldest message when F0OM (CANFD_RXF0C[31]) = 1 will not set this flag.
* @var CANFD_T::RXF0A
* Offset: 0xA8  Rx FIFO 0 Acknowledge
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[5:0]   |F0A       |Rx FIFO 0 Acknowledge Index
* |        |          |After the Host has read a message or a sequence of messages from Rx FIFO 0 it has to write the buffer index of the last element read from Rx FIFO 0 to F0AI
* |        |          |This will set the Rx FIFO 0 Get Index F0GI (CANFD_RXF0S[13:8]) to F0AI (CANFD_RXF0A[5:0]) + 1 and update the FIFO 0 Fill Level F0FL(CANFD_RXF0S[6:0]).
* @var CANFD_T::RXBC
* Offset: 0xAC  Rx Buffer Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[15:2]  |RBSA      |Rx Buffer Start Address
* |        |          |Configures the start address of the Rx Buffers section in the Message RAM (32-bit word address)
* |        |          |Also used to reference debug messages A,B,C.
* @var CANFD_T::RXF1C
* Offset: 0xB0  Rx FIFO 1 Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[15:2]  |F1SA      |Rx FIFO 1 Start Address
* |        |          |Start address of Rx FIFO 1 in Message RAM (32-bit word address, refer to Figure 1.1-11).
* |[22:16] |F1S       |Rx FIFO 1 Size
* |        |          |0= No Rx FIFO 1.
* |        |          |1-64 = Number of Rx FIFO 1 elements.
* |        |          |>64 = Values greater than 64 are interpreted as 64.
* |        |          |The Rx FIFO 1 elements are indexed from 0 to F1S - 1 
* |[30:24] |F1WM      |Rx FIFO 1 Watermark
* |        |          |0= Watermark interrupt disabled.
* |        |          |1-64 = Level for Rx FIFO 1 watermark interrupt (RF1W(CANFD_IR[5])).
* |        |          |>64 = Watermark interrupt disabled.
* |[31]    |F1OM      |FIFO 1 Operation Mode
* |        |          |FIFO 1 can be operated in blocking or in overwrite mode (refer to Rx FIFOs).
* |        |          |0= FIFO 1 blocking mode.
* |        |          |1= FIFO 1 overwrite mode.
* @var CANFD_T::RXF1S
* Offset: 0xB4  Rx FIFO 1 Status
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[6:0]   |F1FL      |Rx FIFO 1 Fill Level
* |        |          |Number of elements stored in Rx FIFO 1, range 0 to 64
* |[13:8]  |F1GI      |Rx FIFO 1 Get Index
* |        |          |Rx FIFO 1 read index pointer, range 0 to 63.
* |[21:16] |F1PI      |Rx FIFO 1 Fill Level
* |        |          |Number of elements stored in Rx FIFO 1, range 0 to 64.
* |[24]    |F1F       |Rx FIFO 1 Full
* |        |          |0 = Rx FIFO 1 is not full.
* |        |          |1 = Rx FIFO 1 is full.
* |[25]    |RF1L      |Rx FIFO 1 Message Lost
* |        |          |This bit is a copy of interrupt flag RF1L(CANFD_IR[7])
* |        |          |When RF1L(CANFD_IR[7]) is reset, this bit is also reset
* |        |          |0= No Rx FIFO 1 message lost.
* |        |          |1= Rx FIFO 1 message lost, also set after write attempt to Rx FIFO 1 of size zero.
* |        |          |Note: Overwriting the oldest message when F1OM (CANFD_RXF1C[31]) = 1 will not set this flag.
* @var CANFD_T::RXF1A
* Offset: 0xB8  Rx FIFO 1 Acknowledge
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[5:0]   |F1AI      |Rx FIFO 1 Acknowledge Index
* |        |          |After the Host has read a message or a sequence of messages from Rx FIFO 1 it has to write the buffer index of the last element read from Rx FIFO 1 to F1AI
* |        |          |This will set the Rx FIFO 1 Get Index F1GI (CANFD_RXF1S[13:8]) to F1AI (CANFD_RXF1A[5:0]) + 1 and update the FIFO 1 Fill Level F1FL (CANFD_RXF1S[6:0]).
* @var CANFD_T::RXESC
* Offset: 0xBC  Rx Buffer / FIFO Element Size Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[2:0]   |F0DS      |Rx FIFO 0 Data Field Size
* |        |          |000 = 8 byte data field.
* |        |          |001 = 12 byte data field.
* |        |          |010 = 16 byte data field.
* |        |          |011 = 20 byte data field.
* |        |          |100 = 24 byte data field.
* |        |          |101 = 32 byte data field.
* |        |          |110 = 48 byte data field.
* |        |          |111 = 64 byte data field.
* |        |          |Note: In case the data field size of an accepted CAN frame exceeds the data field size configured for the matching Rx Buffer or Rx FIFO, only the number of bytes as configured by CANFD_RXESC are stored to the Rx Buffer resp
* |        |          |Rx FIFO element
* |        |          |The rest of the frame data field is ignored.
* |[6:4]   |F1DS      |Rx FIFO 1 Data Field Size
* |        |          |000 = 8 byte data field.
* |        |          |001 = 12 byte data field.
* |        |          |010 = 16 byte data field.
* |        |          |011 = 20 byte data field.
* |        |          |100 = 24 byte data field.
* |        |          |101 = 32 byte data field.
* |        |          |110 = 48 byte data field.
* |        |          |111 = 64 byte data field.
* |[10:8]  |RBDS      |Rx Buffer Data Field Size
* |        |          |000 = 8 byte data field.
* |        |          |001 = 12 byte data field.
* |        |          |010 = 16 byte data field.
* |        |          |011 = 20 byte data field.
* |        |          |100 = 24 byte data field.
* |        |          |101 = 32 byte data field.
* |        |          |110 = 48 byte data field.
* |        |          |111 = 64 byte data field.
* @var CANFD_T::TXBC
* Offset: 0xC0  Tx Buffer Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[15:2]  |TBSA      |Tx Buffers Start Address
* |        |          |Start address of Tx Buffers section in Message RAM (32-bit word address, refer to Figure 1.1-11).
* |        |          |Note: The sum of TFQS and NDTB may be not greater than 32
* |        |          |There is no check for erroneous configurations
* |        |          |The Tx Buffers section in the Message RAM starts with the dedicated Tx Buffers
* |[21:16] |NDTB      |Number of Dedicated Transmit Buffers
* |        |          |0= No Dedicated Tx Buffers.
* |        |          |1-32= Number of Dedicated Tx Buffers.
* |        |          |>32= Values greater than 32 are interpreted as 32.
* |[29:24] |TFQS      |Transmit FIFO/Queue Size
* |        |          |0= No Tx FIFO/Queue.
* |        |          |1-32= Number of Tx Buffers used for Tx FIFO/Queue.
* |        |          |>32= Values greater than 32 are interpreted as 32.
* |[30]    |TFQM      |Tx FIFO/Queue Mode
* |        |          |0= Tx FIFO operation.
* |        |          |1= Tx Queue operation.
* @var CANFD_T::TXFQS
* Offset: 0xC4  Tx FIFO/Queue Status
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[5:0]   |TFFL      |Tx FIFO Free Level
* |        |          |Number of consecutive free Tx FIFO elements starting from TFGI, range 0 to 32
* |        |          |Read as zero when Tx Queue operation is configured (TFQM (CANFD_TXBC[30]) = 1).
* |        |          |Note: In case of mixed configurations where dedicated Tx Buffers are combined with a Tx FIFO or a Tx Queue, the Put and Get Indices indicate the number of the Tx Buffer starting with the first dedicated Tx Buffers.
* |        |          |Example: For a configuration of 12 dedicated Tx Buffers and a Tx FIFO of 20 Buffers a Put Index of 15 points to the fourth buffer of the Tx FIFO.
* |[12:8]  |TFGI      |Tx FIFO Get Index
* |        |          |Tx FIFO read index pointer, range 0 to 31
* |        |          |Read as zero when Tx Queue operation is configured (TFQM (CANFD_TXBC[30]) = 1).
* |[20:16] |TFQPI     |Tx FIFO/Queue Put Index
* |        |          |Tx FIFO/Queue write index pointer, range 0 to 31.
* |[21]    |TFQF      |Tx FIFO/Queue Full
* |        |          |0= Tx FIFO/Queue is not full.
* |        |          |1= Tx FIFO/Queue is full.
* @var CANFD_T::TXESC
* Offset: 0xC8  Tx Buffer Element Size Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[2:0]   |TBDS      |Tx Buffer Data Field Size
* |        |          |000 = 8 byte data field.
* |        |          |001 = 12 byte data field.
* |        |          |010 = 16 byte data field.
* |        |          |011 = 20 byte data field.
* |        |          |100 = 24 byte data field.
* |        |          |101 = 32 byte data field.
* |        |          |110 = 48 byte data field.
* |        |          |111 = 64 byte data field.
* |        |          |Note: In case the data length code DLC of a Tx Buffer element is configured to a value higher than the Tx Buffer data field size TBDS(CANFD_TXESC[2:0]), the bytes not defined by the Tx Buffer are transmitted as 0xCC (padding bytes).
* @var CANFD_T::TXBRP
* Offset: 0xCC  Tx Buffer Request Pending
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[31:0]  |TRPn      |Transmission Request Pending Each Tx Buffer has its own Transmission Request Pending bit The bits are set via register CANFD_TXBAR The bits are reset after a requested transmission has completed or has been cancelled via register CANFD_TXBCR
* |        |          |CANFD_TXBRP bits are set only for those Tx Buffers configured via CANFD_TXBC
* |        |          |After a CANFD_TXBRP bit has been set, a Tx scan (refer to 1.1.5.5, Tx Handling) is started to check for the pending Tx request with the highest priority (Tx Buffer with lowest Message ID).
* |        |          |A cancellation request resets the corresponding transmission request pending bit of register CANFD_TXBRP.
* |        |          |In case a transmission has already been started when a cancellation is requested, this is done at the end of the transmission, regardless whether the transmission was successful or not.
* |        |          |The cancellation request bits are reset directly after the corresponding CANFD_TXBRP bit has been reset.
* |        |          |After a cancellation has been requested, a finished cancellation is signaled via CANFD_TXBCF.
* |        |          |- after successful transmission together with the corresponding CANFD_TXBTO bit.
* |        |          |- when the transmission has not yet been started at the point of cancellation.
* |        |          |- when the transmission has been aborted due to lost arbitration.
* |        |          |- when an error occurred during frame transmission.
* |        |          |In DAR mode all transmissions are automatically cancelled if they are not successful.
* |        |          |The corresponding CANFD_TXBCF bit is set for all unsuccessful transmissions.
* |        |          |0 = No transmission request pending.
* |        |          |1 = Transmission request pending.
* |        |          |Note: CANFD_TXBRP bits which are set while a Tx scan is in progress are not considered during this particular Tx scan.
* |        |          |In case a cancellation is requested for such a Tx Buffer, this Add Request is cancelled immediately, the corresponding CANFD_TXBRP bit is reset.
* @var CANFD_T::TXBAR
* Offset: 0xD0  Tx Buffer Add Request
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[31:0]  |ARn       |Add Request Each Tx Buffer has its own Add Request bit Writing a 1 will set the corresponding Add Request bit; writing a 0 has no impact This enables the Host to set transmission requests for multiple Tx Buffers with one write to CANFD_TXBAR CANFD_TXBAR bits are set only for those Tx Buffers configured via CANFD_TXBC When no Tx scan is running, the bits are reset immediately, else the bits remain set until the Tx scan process has completed
* |        |          |0 = No transmission request added.
* |        |          |1 = Transmission requested added.
* |        |          |Note: If an add request is applied for a Tx Buffer with pending transmission request (corre- sponding CANFD_TXBRP bit already set), this add request is ignored.
* @var CANFD_T::TXBCR
* Offset: 0xD4  Tx Buffer Cancellation Request
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[31:0]  |CRn       |Cancellation Request
* |        |          |Each Tx Buffer has its own Cancellation Request bit.
* |        |          |Writing a 1 will set the corresponding Cancellation Request bit; writing a 0 has no impact.
* |        |          |This enables the Host to set cancellation requests for multiple Tx Buffers with one write to CANFD_TXBCR.
* |        |          |CANFD_TXBCR bits are set only for those Tx Buffers configured via CANFD_TXBC.
* |        |          |The bits remain set until the corresponding bit of CANFD_TXBRP is reset.
* |        |          |0 = No cancellation pending.
* |        |          |1 = Cancellation pending.
* @var CANFD_T::TXBTO
* Offset: 0xD8  Tx Buffer Transmission Occurred
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[31:0]  |TOn       |Transmission Occurred
* |        |          |Each Tx Buffer has its own Transmission Occurred bit.
* |        |          |The bits are set when the corresponding CANFD_TXBRP bit is cleared after a successful transmission.
* |        |          |The bits are reset when a new transmission is requested by writing a 1 to the corresponding bit of register CANFD_TXBAR.
* |        |          |0 = No transmission occurred.
* |        |          |1 = Transmission occurred.
* @var CANFD_T::TXBCF
* Offset: 0xDC  Tx Buffer Cancellation Finished
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[31:0]  |CFn       |Cancellation Finished
* |        |          |Each Tx Buffer has its own Cancellation Finished bit.
* |        |          |The bits are set when the corresponding CANFD_TXBRP bit is cleared after a cancellation was requested via CANFD_TXBCR.
* |        |          |In case the corresponding CANFD_TXBRP bit was not set at the point of cancellation, CF is set immediately.
* |        |          |The bits are reset when a new transmission is requested by writing a 1 to the corresponding bit of register CANFD_TXBAR.
* |        |          |0 = No transmit buffer cancellation.
* |        |          |1 = Transmit buffer cancellation finished.
* @var CANFD_T::TXBTIE
* Offset: 0xE0  Tx Buffer Transmission Interrupt Enable
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[31:0]  |TIEn      |Transmission Interrupt Enable
* |        |          |Each Tx Buffer has its own Transmission Interrupt Enable bit.
* |        |          |0 = Transmission interrupt disabled.
* |        |          |1 = Transmission interrupt enable.
* @var CANFD_T::TXBCIE
* Offset: 0xE4  Tx Buffer Cancellation Finished Interrupt Enable
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[31:0]  |CFIEn     |Cancellation Finished Interrupt Enable
* |        |          |Each Tx Buffer has its own Cancellation Finished Interrupt Enable bit.
* |        |          |0 = Cancellation finished interrupt disabled.
* |        |          |1 = Cancellation finished interrupt enabled.
* @var CANFD_T::TXEFC
* Offset: 0xF0  Tx Event FIFO Configuration (P*)
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[15:2]  |EFSA      |Event FIFO Start Address
* |        |          |Start address of Tx Event FIFO in Message RAM (32-bit word address, refer to Figure 1.1-11).
* |[21:16] |EFS       |Event FIFO Size
* |        |          |0= Tx Event FIFO disabled.
* |        |          |1-32= Number of Tx Event FIFO elements.
* |        |          |>32= Values greater than 32 are interpreted as 32.
* |        |          |The Tx Event FIFO elements are indexed from 0 to EFS - 1 
* |[29:24] |EFWM      |Event FIFO Watermark
* |        |          |0 = Watermark interrupt disabled.
* |        |          |1-32= Level for Tx Event FIFO watermark interrupt (TEFW (CANFD_IR[13])).
* |        |          |>32= Watermark interrupt disabled.
* @var CANFD_T::TXEFS
* Offset: 0xF4  Tx Event FIFO Status
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[5:0]   |EFFL      |Event FIFO Fill Level
* |        |          |Number of elements stored in Tx Event FIFO, range 0 to 32
* |[12:8]  |EFGI      |Event FIFO Get Index
* |        |          |Tx Event FIFO read index pointer, range 0 to 31
* |[20:16] |EFPI      |Event FIFO Put Index
* |        |          |Tx Event FIFO write index pointer, range 0 to 31
* |[24]    |EFF       |Event FIFO Full
* |        |          |0= Tx Event FIFO is not full.
* |        |          |1= Tx Event FIFO is full.
* |[25]    |TEFL      |Tx Event FIFO Element Lost
* |        |          |This bit is a copy of interrupt flag TEFL (CANFD_IR[15]). When TEFL is reset, this bit is also reset.
* |        |          |0= No Tx Event FIFO element lost.
* |        |          |1= Tx Event FIFO element lost, also set after write attempt to Tx Event FIFO of size zero.
* @var CANFD_T::TXEFA
* Offset: 0xF8  Tx Event FIFO Acknowledge
* ---------------------------------------------------------------------------------------------------
* |Bits    |Field     |Descriptions
* | :----: | :----:   | :---- |
* |[4:0]   |EFAI      |Event FIFO Acknowledge Index
* |        |          |After the Host has read an element or a sequence of elements from the Tx Event FIFO it has to write the index of the last element read from Tx Event FIFO to EFAI
* |        |          |This will set the Tx Event FIFO Get Index EFGI (CANFD_TXEFS[12:8]) to EFAI + 1 and update the Event FIFO Fill Level EFFL (CANFD_TXEFS[5:0])
*/
/// @cond HIDDEN_SYMBOLS
__I  uint32_t RESERVE0[3];
/// @endcond //HIDDEN_SYMBOLS
__IO uint32_t DBTP;                 /*!< [0x000c] Data Bit Timing & Prescaler Register                             */
__IO uint32_t TEST;                 /*!< [0x0010] Test Register                                                    */
__IO uint32_t RWD;                  /*!< [0x0014] RAM Watchdog                                                     */
__IO uint32_t CCCR;                 /*!< [0x0018] CC Control Register                                              */
__IO uint32_t NBTP;                 /*!< [0x001c] Nominal Bit Timing & Prescaler Register                          */
__IO uint32_t TSCC;                 /*!< [0x0020] Timestamp Counter Configuration                                  */
__IO uint32_t TSCV;                 /*!< [0x0024] Timestamp Counter Value                                          */
__IO uint32_t TOCC;                 /*!< [0x0028] Timeout Counter Configuration                                    */
__IO uint32_t TOCV;                 /*!< [0x002c] Timeout Counter Value                                            */
/// @cond HIDDEN_SYMBOLS
__I  uint32_t RESERVE1[4];
/// @endcond //HIDDEN_SYMBOLS
__I  uint32_t ECR;                  /*!< [0x0040] Error Counter Register                                           */
__I  uint32_t PSR;                  /*!< [0x0044] Protocol Status Register                                         */
__IO uint32_t TDCR;                 /*!< [0x0048] Transmitter Delay Compensation Register                          */
/// @cond HIDDEN_SYMBOLS
__I  uint32_t RESERVE2[1];
/// @endcond //HIDDEN_SYMBOLS
__IO uint32_t IR;                   /*!< [0x0050] Interrupt Register                                               */
__IO uint32_t IE;                   /*!< [0x0054] Interrupt Enable                                                 */
